

<?php


/*
هاذي لجمع الاعداد الزوجيه من 1الى 30
$X=1;
$sum=0;//هاذي الي راح نجمع عليها
	while($X<=30){
		if($X%2==0)//هاذي عشان اذا تبي الاعرار الزوجيه او الفرديه
	$sum+=$X;//1 3 6 10 15
	$X++;
	}
echo "$sum";
*/

/*
$X=1;
$sum=0;//هاذي الي راح نجمع عليها
	while($X<=5){
	$sum+=$X;//1 3 6 10 15
$X++;
	}
echo "$sum";
*/








/*
echo "<ul>";
$x=1;
while($x<=12)
{
	if($x%2==1)
		echo"<li>$x<li/><Br/>";
	
	$x++;
	
}
echo "<ul/>";*/
/*
$A=1;
while($A<=30){
	echo "$A</br>";
	$A+=2;
}
*/
?>